/*
 * frame_errordef.h
 *
 *  Created on: 2011-8-23
 *      Author: jimm
 */

#ifndef FRAME_ERRORDEF_H_
#define FRAME_ERRORDEF_H_

#include "common/common_errordef.h"
#include "frame_namespace.h"


FRAME_NAMESPACE_BEGIN

/***************************************************************************************************
* 错误标识：	E_LIBF_UNKNOWN
*
* 错误描述：	未知错误
*/
#define E_LIBF_UNKNOWN													0x84000000

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATELOGQUEUESM
*
* 错误描述：	日志队列共享内存创建失败
*/
#define E_LIBF_CREATELOGQUEUESM											0x84000001


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATELOGICNETQUEUESM
*
* 错误描述：	Logic通讯队列共享内存创建失败
*/
#define E_LIBF_CREATELOGICNETQUEUESM									0x84000002


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATECENTERNETQUEUE
*
* 错误描述：	Center通讯队列共享内存创建失败
*/
#define E_LIBF_CREATECENTERNETQUEUE										0x84000003

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEWEBNETQUEUE
*
* 错误描述：	Web通讯队列共享内存创建失败
*/
#define E_LIBF_CREATEWEBNETQUEUE										0x84000004


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEDATACENTER
*
* 错误描述：	Datacenter创建失败
*/
#define E_LIBF_CREATEDATACENTER											0x84000005

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEUSRDATACENTER
*
* 错误描述：	UsrDatacenter创建失败
*/
#define E_LIBF_CREATEUSRDATACENTER										0x84000006


/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDENTITYTYPE
*
* 错误描述：	无效的服务器类型
*/
#define E_LIBF_INVALIDENTITYTYPE										0x84000007


/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDPACKAGELENGTH
*
* 错误描述：	无效的数据包长度
*/
#define E_LIBF_INVALIDPACKAGELENGTH										0x84000008


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATESESSION
*
* 错误描述：	会话创建失败
*/
#define E_LIBF_CREATESESSION											0x84000009

/***************************************************************************************************
* 错误标识：	E_LIBF_SESSIONNOTEXIST
*
* 错误描述：	会话不存在
*/
#define E_LIBF_SESSIONNOTEXIST											0x8400000a


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATETIMER
*
* 错误描述：	创建定时器失败
*/
#define E_LIBF_CREATETIMER												0x8400000b

/***************************************************************************************************
* 错误标识：	E_LIBF_TIMERNOTEXIST
*
* 错误描述：	定时器不存在
*/
#define E_LIBF_TIMERNOTEXIST											0x8400000c


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEDBACCESSTHREAD
*
* 错误描述：	数据库连接创建失败
*/
#define E_LIBF_CREATEDBACCESSTHREAD										0x8400000d


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATENETIOTHREAD
*
* 错误描述：	网络通信线程创建失败
*/
#define E_LIBF_CREATENETIOTHREAD										0x8400000e


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATELOGTHREAD
*
* 错误描述：	日志通信线程创建失败
*/
#define E_LIBF_CREATELOGTHREAD											0x8400000f

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEMAINTHREAD
*
* 错误描述：	Main线程创建失败
*/
#define E_LIBF_CREATEMAINTHREAD											0x84000010

/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDTHREADID
*
* 错误描述：	无效的线程ID
*/
#define E_LIBF_INVALIDTHREADID											0x84000011


/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDMESSAGEID
*
* 错误描述：	无效的消息ID
*/
#define E_LIBF_INVALIDMESSAGEID											0x84000012


/***************************************************************************************************
* 错误标识：	E_LIBF_LOADROUTERCONFIGFILE
*
* 错误描述：	加载Router失败
*/
#define E_LIBF_LOADROUTERCONFIGFILE										0x84000013

/***************************************************************************************************
* 错误标识：	E_LIBF_ROUTERCONFIGROOT
*
* 错误描述：	加载Router根节点失败
*/
#define E_LIBF_ROUTERCONFIGROOT											0x84000014

/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDZONEID
*
* 错误描述：	无效的ZONEID
*/
#define E_LIBF_INVALIDZONEID											0x84000015

/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDSESSIONIMPL
*
* 错误描述：	无效的会话接口
*/
#define E_LIBF_INVALIDSESSIONIMPL										0x84000016

/***************************************************************************************************
* 错误标识：	E_LIBF_UNEXCEPTTIMERTYPE
*
* 错误描述：	定时器类型不匹配
*/
#define E_LIBF_UNEXCEPTTIMERTYPE										0x84000017

/***************************************************************************************************
* 错误标识：	E_LIBF_LOADCONFIGFILE
*
* 错误描述：	服务器配置文件加载失败
*/
#define E_LIBF_LOADCONFIGFILE											0x84000018


/***************************************************************************************************
* 错误标识：	E_LIBF_CONFIGNOKEY
*
* 错误描述：	服务器配置文件Key节点为空
*/
#define E_LIBF_CONFIGNOKEY												0x84000019

/***************************************************************************************************
* 错误标识：	E_LIBF_CONFIGCSCHANNELKEY
*
* 错误描述：	服务器配置文件CSChannelKey配置错误
*/
#define E_LIBF_CONFIGCSCHANNELKEY										0x84000010

/***************************************************************************************************
* 错误标识：	E_LIBF_CONFIGSCCHANNELKEY
*
* 错误描述：	服务器配置文件SCChannelKey配置错误
*/
#define E_LIBF_CONFIGSCCHANNELKEY										0x8400001a

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATETIMERMGT
*
* 错误描述：	创建Timer管理器失败
*/
#define E_LIBF_CREATETIMERMGT											0x8400001b

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATESESSIONMGT
*
* 错误描述：	创建Session管理器失败
*/
#define E_LIBF_CREATESESSIONMGT											0x8400001c

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEMSGEVENTMGT
*
* 错误描述：	创建MsgEvent管理器失败
*/
#define E_LIBF_CREATEMSGEVENTMGT										0x8400001d

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATELOGQUEUE
*
* 错误描述：	创建日志队列失败
*/
#define E_LIBF_CREATELOGQUEUE											0x8400001e

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATECENTERQUEUE
*
* 错误描述：	创建Center队列失败
*/
#define E_LIBF_CREATECENTERQUEUE										0x8400001f

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATELOGICQUEUE
*
* 错误描述：	创建Logic队列失败
*/
#define E_LIBF_CREATELOGICQUEUE											0x84000020

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEWEBCSQUEUE
*
* 错误描述：	创建WebCS队列失败
*/
#define E_LIBF_CREATEWEBCSQUEUE											0x84000021

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEWEBSCQUEUE
*
* 错误描述：	创建WebSC队列失败
*/
#define E_LIBF_CREATEWEBSCQUEUE											0x84000022

/***************************************************************************************************
* 错误标识：	E_LIBF_MSGIDNOMSGBODY
*
* 错误描述：	找不到MSGID对应的IMsgBody
*/
#define E_LIBF_MSGIDNOMSGBODY											0x84000023

/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDPRITYPE
*
* 错误描述：	无效的优先级类型
*/
#define E_LIBF_INVALIDPRITYPE											0x84000024

/***************************************************************************************************
* 错误标识：	E_LIBF_LOGLEVEL
*
* 错误描述：	日志等级不够
*/
#define E_LIBF_LOGLEVEL													0x84000024


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEPLAYER
*
* 错误描述：	玩家对象创建失败
*/
#define E_LIBF_CREATEPLAYER												0x84000025


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEPLAYERINDEX
*
* 错误描述：	玩家对象索引创建失败
*/
#define E_LIBF_CREATEPLAYERINDEX										0x84000026


/***************************************************************************************************
* 错误标识：	E_LIBF_PLAYERNOTFOUND
*
* 错误描述：	找不到玩家对象
*/
#define E_LIBF_PLAYERNOTFOUND											0x84000027


/***************************************************************************************************
* 错误标识：	E_LIBF_PLAYERNOTEXIST
*
* 错误描述：	玩家对象不存在
*/
#define E_LIBF_PLAYERNOTEXIST											0x84000028


/***************************************************************************************************
* 错误标识：	E_LIBF_NOMESSAGETORECEIVE
*
* 错误描述：	未接收到完整的消息
*/
#define E_LIBF_NOMESSAGETORECEIVE										0x84000029


/***************************************************************************************************
* 错误标识：	E_LIBF_NODATATOSEND
*
* 错误描述：	没有待发送的数据
*/
#define E_LIBF_NODATATOSEND												0x8400002a


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEACTIVITY
*
* 错误描述：	创建活动对象失败
*/
#define E_LIBF_CREATEACTIVITY											0x8400002b


/***************************************************************************************************
* 错误标识：	E_LIBF_ACTIVITYEXIST
*
* 错误描述：	相同的活动已经存在
*/
#define E_LIBF_ACTIVITYEXIST											0x8400002c


/***************************************************************************************************
* 错误标识：	E_LIBF_ACTIVITYNOTFOUND
*
* 错误描述：	找不到活动对象
*/
#define E_LIBF_ACTIVITYNOTFOUND											0x8400002d


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATESESSIONINDEX
*
* 错误描述：	会话对象索引创建失败
*/
#define E_LIBF_CREATESESSIONINDEX										0x8400002e


/***************************************************************************************************
* 错误标识：	E_LIBF_SESSIONNOTFOUND
*
* 错误描述：	找不到指定会话
*/
#define E_LIBF_SESSIONNOTFOUND											0x84000030


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATETIMERINDEX
*
* 错误描述：	创建定时器索引失败
*/
#define E_LIBF_CREATETIMERINDEX											0x84000031


/***************************************************************************************************
* 错误标识：	E_LIBF_TIMERNOTFOUND
*
* 错误描述：	找不到指定定时器
*/
#define E_LIBF_TIMERNOTFOUND											0x84000032


/***************************************************************************************************
* 错误标识：	E_LIBF_NOTIMER
*
* 错误描述：	当前定时器池中没有定时器
*/
#define E_LIBF_NOTIMER													0x84000033


/***************************************************************************************************
* 错误标识：	E_LIBF_INVALIDTIMERINDEX
*
* 错误描述：	无效的定时器索引
*/
#define E_LIBF_INVALIDTIMERINDEX										0x84000034

/***************************************************************************************************
* 错误标识：	E_LIBF_CONTAINERFULL
*
* 错误描述：	容器满
*/
#define E_LIBF_CONTAINERFULL											0x84000035

/***************************************************************************************************
* 错误标识：	E_LIBF_CONTAINEREMPUTY
*
* 错误描述：	容器空
*/
#define E_LIBF_CONTAINEREMPUTY											0x84000036

/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEROOM
*
* 错误描述：	房间对象创建失败
*/
#define E_LIBF_CREATEROOM										0x84000037


/***************************************************************************************************
* 错误标识：	E_LIBF_CREATEROOMINDEX
*
* 错误描述：	房间对象索引创建失败
*/
#define E_LIBF_CREATEROOMINDEX									0x84000038


/***************************************************************************************************
* 错误标识：	E_LIBF_ROOMNOTFOUND
*
* 错误描述：	找不到房间对象
*/
#define E_LIBF_ROOMNOTFOUND										0x84000039


/***************************************************************************************************
* 错误标识：	E_LIBF_ROOMNOTEXIST
*
* 错误描述：	房间对象不存在
*/
#define E_LIBF_ROOMNOTEXIST										0x8400003a

/***************************************************************************************************
* 错误标识：	E_LIBF_ALLOCBLOCKFAILED
*
* 错误描述：	创建内存块失败
*/
#define E_LIBF_ALLOCBLOCKFAILED										0x8400003b


FRAME_NAMESPACE_END

#endif /* FRAME_ERRORDEF_H_ */
